; domain
(define (domain singeBananes)
	(:requirements :strips :typing)
	(:types object position level)
	(:predicates
		(situe ?x - object ?y - position)
		(niveau ?x - object ?y - level)
		(possede ?x - object ?y - object)
		(mainsVides)
	)
	(:action seDeplace ;;; action qui permet au singe de se deplacer
		:parameters (?x - position ?y - position)
		:precondition (and (situe Singe ?x) (niveau Singe Bas))
		:effect (and (not (situe Singe ?x)) (situe Singe ?y))
	)
	(:action prend ;;; action qui permet au singe de prendre un objet
		:parameters (?x - object ?y - position ?z - level)
		:precondition (and 
				(mainsVides) 
				(situe Singe ?y) 
				(situe ?x ?y) 
				(niveau Singe ?z) 
				(niveau ?x ?z))
		:effect (and (not (mainsVides)) (possede Singe ?x) (not (situe ?x ?y)) (not (niveau ?x ?z)))
	)
	(:action depose ;;; action qui permet au singe de deposer un objet
		:parameters (?x - object ?y - position ?z - level)
		:precondition (and (possede Singe ?x) (situe Singe ?y) (niveau Singe ?z))
		:effect (and (mainsVides) (not (possede Singe ?x)) (situe ?x ?y) (niveau ?x ?z))
	)
	(:action monteCaisse ;;; action qui permet au singe de monter sur la caisse
		:parameters (?y - position)
		:precondition (and (situe Singe ?y) (niveau Singe Bas) (situe Caisse ?y) (niveau Caisse Bas))
		:effect (and (niveau Singe Haut) (not (niveau Singe Bas)))
	)
)

; problem
(define (problem singeBananes)
	(:domain singeBananes)
	(:objects Singe Bananes Caisse - object A B C - position Haut Bas - level)
	(:init (situe Singe A) (situe Bananes B) (situe Caisse C) (niveau Singe Bas)
		(niveau Caisse Bas) (niveau Bananes Haut) (mainsVides)

	)
	(:goal (possede Singe Bananes))
)

; plan
1. (sedeplace a c)
   deleted: (situe singe a)
   added: (situe singe c)
   goals met: 0 of 1
2. (prend caisse c bas)
   deleted: (mainsvides) (situe caisse c) (niveau caisse bas)
   added: (possede singe caisse)
   goals met: 0 of 1
3. (sedeplace c b)
   deleted: (situe singe c)
   added: (situe singe b)
   goals met: 0 of 1
4. (depose caisse b bas)
   deleted: (possede singe caisse)
   added: (mainsvides) (situe caisse b) (niveau caisse bas)
   goals met: 0 of 1
5. (montecaisse b)
   deleted: (niveau singe bas)
   added: (niveau singe haut)
   goals met: 0 of 1
6. (prend bananes b haut)
   deleted: (mainsvides) (situe bananes b) (niveau bananes haut)
   added: (possede singe bananes)
   goals met: 1 of 1
